tap "homebrew/services"

# Build deps
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "cmake"
brew "gcc"
brew "readline"
brew "libyaml"
brew "openssl@1.1"
brew "openssl@3"

# CLI tools
brew "zsh"

## GNU
brew "coreutils"
brew "findutils"
# brew "moreutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnuplot"
brew "gnupg"
brew "tree"
brew "watch"
brew "wget"

brew "fzf"
brew "ripgrep"
brew "htop"
brew "curl"
brew "httpie"
brew "bat" # cat 
brew "broot" # ls/mc
brew "fd" # find
brew "diff-so-fancy" # diff
brew "git-delta" # another diff
brew "fx" # json viewer
brew "gdu" # du optimized for SSD
brew "lesspipe"
brew "tldr"

# brew "jq"
# brew "mosh"
# brew "ngrep" # network grep

# Dev

brew "git"
brew "git-fixup"
brew "git-secret"
brew "chruby"
brew "ruby-install"
brew "python"
brew "node"
brew "go"
brew "gopls" # Go LSP
brew "jupyterlab"
brew "redis"

brew "neovim", args: ["HEAD"]

cask "kitty"
cask "fork"
cask "insomnia"
cask "viscosity"

## Docker

brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "kubernetes-cli"
brew "k9s"
brew "helm"
# brew "hyperkit"

# Misc Apps

cask "airflow"
cask "alfred"
cask "anki"
cask "coconutbattery"
cask "hammerspoon"
cask "iina"
cask "telegram"
cask "transmission"
cask "typora"
cask "spotify"
cask "readdle-spark"
cask "miro"
cask "proxyman"
cask "notion"
cask "microsoft-edge"
# cask "orion"
